x1, y1 = float(input("Координата X первой точки: ")), float(input("Координата Y первой точки: "))
x2, y2 = float(input("Координата X второй точки: ")), float(input("Координата Y второй точки: "))
x3, y3 = float(input("Координата X третьей точки: ")), float(input("Координата Y третьей точки: "))
a = ((x2-x1)**2+(y2-y1)**2)**0.5
b = ((x3-x2)**2+(y3-y2)**2)**0.5
c = ((x3-x1)**2+(y3-y1)**2)**0.5
p = (a + b + c)/2
s = (p*(p-a)*(p-b)*(p-c))**0.5
print("Периметр треугольника: "+str(2*p))
print("Площадь треугольника: "+str(s))
